zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/DSC/MC56F80xxx/MC56F80623/MC56F80623_COMMON.h
/*
** ###################################################################
**     Processor:           MC56F80623VLC
**     Compiler:            CodeWarrior C/C++ for DSP M56800E
**     Reference manual:    Manual version TBD
**     Version:             rev. 1.0, 2024-10-29
**     Build:               b250520
**
**     Abstract:
**         Peripheral Access Layer for MC56F80623
**
**     Copyright 1997-2016 Freescale Semiconductor, Inc.
**     Copyright 2016-2025 NXP
**     SPDX-License-Identifier: BSD-3-Clause
**
**     http:                 www.nxp.com
**     mail:                 support@nxp.com
**
**     Revisions:
**     - rev. 0.1 (2022-01-12)
**         Initial version.
**     - rev. 1.0 (2024-10-29)
**         Change the device header file from single flat file to multiple files based on peripherals,
**         each peripheral with dedicated header file located in periphN folder.
**
** ###################################################################
*/

/*!
 * @file MC56F80623_COMMON.h
 * @version 1.0
 * @date 2024-10-29
 * @brief Peripheral Access Layer for MC56F80623
 *
 * Peripheral Access Layer for MC56F80623
 */

#if !defined(MC56F80623_COMMON_H_)
#define MC56F80623_COMMON_H_                     /**< Symbol preventing repeated inclusion */

/** Memory map major version (memory maps with equal major version number are
 * compatible) */
#define MCU_MEM_MAP_VERSION 0x0100U
/** Memory map minor version */
#define MCU_MEM_MAP_VERSION_MINOR 0x0000U


/* ----------------------------------------------------------------------------
   -- Interrupt IRQ numbers
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup Interrupt_IRQ_numbers Interrupt IRQ numbers
 * @{
 */

/** Interrupt Number Definitions */
#define NUMBER_OF_INT_IRQ    104                 /**< Number of interrupts in the IRQ table */

typedef enum IRQn {
  /* Device specific interrupts */
  STPCNT_IRQn                  = 0,                /**< STPCNT interrupt */
  BKPT_IRQn                    = 1,                /**< BKPT interrupt */
  TRBUF_IRQn                   = 2,                /**< TRBUF interrupt */
  TX_REG_IRQn                  = 3,                /**< TX_REG interrupt */
  RX_REG_IRQn                  = 4,                /**< RX_REG interrupt */
  BUS_ERR_IRQn                 = 5,                /**< BUS_ERR interrupt */
  Reserved6_IRQn               = 6,                /**< Reserved interrupt */
  Reserved7_IRQn               = 7,                /**< Reserved interrupt */
  Reserved8_IRQn               = 8,                /**< Reserved interrupt */
  XBARA_IRQn                   = 9,                /**< XBARA interrupt */
  LVI1_IRQn                    = 10,               /**< LVI1 interrupt */
  OCCS_IRQn                    = 11,               /**< OCCS interrupt */
  Reserved12_IRQn              = 12,               /**< Reserved interrupt */
  Reserved13_IRQn              = 13,               /**< Reserved interrupt */
  Reserved14_IRQn              = 14,               /**< Reserved interrupt */
  Reserved15_IRQn              = 15,               /**< Reserved interrupt */
  TMRA_3_IRQn                  = 16,               /**< TMRA_3 interrupt */
  TMRA_2_IRQn                  = 17,               /**< TMRA_2 interrupt */
  TMRA_1_IRQn                  = 18,               /**< TMRA_1 interrupt */
  TMRA_0_IRQn                  = 19,               /**< TMRA_0 interrupt */
  ADC_CC1_IRQn                 = 20,               /**< ADC_CC1 interrupt */
  ADC_CC0_IRQn                 = 21,               /**< ADC_CC0 interrupt */
  ADC_ERR_IRQn                 = 22,               /**< ADC_ERR interrupt */
  DMA_ERR_IRQn                 = 23,               /**< DMA_ERR interrupt */
  DMA3_IRQn                    = 24,               /**< DMA3 interrupt */
  DMA2_IRQn                    = 25,               /**< DMA2 interrupt */
  DMA1_IRQn                    = 26,               /**< DMA1 interrupt */
  DMA0_IRQn                    = 27,               /**< DMA0 interrupt */
  Reserved28_IRQn              = 28,               /**< Reserved interrupt */
  Reserved29_IRQn              = 29,               /**< Reserved interrupt */
  Reserved30_IRQn              = 30,               /**< Reserved interrupt */
  Reserved31_IRQn              = 31,               /**< Reserved interrupt */
  Reserved32_IRQn              = 32,               /**< Reserved interrupt */
  Reserved33_IRQn              = 33,               /**< Reserved interrupt */
  Reserved34_IRQn              = 34,               /**< Reserved interrupt */
  Reserved35_IRQn              = 35,               /**< Reserved interrupt */
  Reserved36_IRQn              = 36,               /**< Reserved interrupt */
  Reserved37_IRQn              = 37,               /**< Reserved interrupt */
  Reserved38_IRQn              = 38,               /**< Reserved interrupt */
  Reserved39_IRQn              = 39,               /**< Reserved interrupt */
  Reserved40_IRQn              = 40,               /**< Reserved interrupt */
  Reserved41_IRQn              = 41,               /**< Reserved interrupt */
  QSCI0_RERR_IRQn              = 42,               /**< QSCI0_RERR interrupt */
  QSCI0_RCV_IRQn               = 43,               /**< QSCI0_RCV interrupt */
  QSCI0_TRIDLE_IRQn            = 44,               /**< QSCI0_TRIDLE interrupt */
  QSCI0_TDRE_IRQn              = 45,               /**< QSCI0_TDRE interrupt */
  Reserved46_IRQn              = 46,               /**< Reserved interrupt */
  Reserved47_IRQn              = 47,               /**< Reserved interrupt */
  Reserved48_IRQn              = 48,               /**< Reserved interrupt */
  Reserved49_IRQn              = 49,               /**< Reserved interrupt */
  QSPI0_XMIT_IRQn              = 50,               /**< QSPI0_XMIT interrupt */
  QSPI0_RCV_IRQn               = 51,               /**< QSPI0_RCV interrupt */
  Reserved52_IRQn              = 52,               /**< Reserved interrupt */
  LPI2C0_IRQn                  = 53,               /**< LPI2C0 interrupt */
  Reserved54_IRQn              = 54,               /**< Reserved interrupt */
  Reserved55_IRQn              = 55,               /**< Reserved interrupt */
  Reserved56_IRQn              = 56,               /**< Reserved interrupt */
  Reserved57_IRQn              = 57,               /**< Reserved interrupt */
  Reserved58_IRQn              = 58,               /**< Reserved interrupt */
  Reserved59_IRQn              = 59,               /**< Reserved interrupt */
  Reserved60_IRQn              = 60,               /**< Reserved interrupt */
  Reserved61_IRQn              = 61,               /**< Reserved interrupt */
  Reserved62_IRQn              = 62,               /**< Reserved interrupt */
  Reserved63_IRQn              = 63,               /**< Reserved interrupt */
  Reserved64_IRQn              = 64,               /**< Reserved interrupt */
  Reserved65_IRQn              = 65,               /**< Reserved interrupt */
  Reserved66_IRQn              = 66,               /**< Reserved interrupt */
  Reserved67_IRQn              = 67,               /**< Reserved interrupt */
  eFlexPWMA_FAULT_IRQn         = 68,               /**< eFlexPWMA_FAULT interrupt */
  eFlexPWMA_RERR_IRQn          = 69,               /**< eFlexPWMA_RERR interrupt */
  eFlexPWMA_CAP_IRQn           = 70,               /**< eFlexPWMA_CAP interrupt */
  eFlexPWMA_RELOAD3_IRQn       = 71,               /**< eFlexPWMA_RELOAD3 interrupt */
  eFlexPWMA_CMP3_IRQn          = 72,               /**< eFlexPWMA_CMP3 interrupt */
  eFlexPWMA_RELOAD2_IRQn       = 73,               /**< eFlexPWMA_RELOAD2 interrupt */
  eFlexPWMA_CMP2_IRQn          = 74,               /**< eFlexPWMA_CMP2 interrupt */
  eFlexPWMA_RELOAD1_IRQn       = 75,               /**< eFlexPWMA_RELOAD1 interrupt */
  eFlexPWMA_CMP1_IRQn          = 76,               /**< eFlexPWMA_CMP1 interrupt */
  eFlexPWMA_RELOAD0_IRQn       = 77,               /**< eFlexPWMA_RELOAD0 interrupt */
  eFlexPWMA_CMP0_IRQn          = 78,               /**< eFlexPWMA_CMP0 interrupt */
  FTFA_RDCOL_IRQn              = 79,               /**< FTFA_RDCOL interrupt */
  FTFA_CC_IRQn                 = 80,               /**< FTFA_CC interrupt */
  Reserved81_IRQn              = 81,               /**< Reserved interrupt */
  CMPC_IRQn                    = 82,               /**< CMPC interrupt */
  CMPB_OPAMPB_IRQn             = 83,               /**< CMPB_OPAMPB interrupt */
  CMPA_OPAMPA_IRQn             = 84,               /**< CMPA_OPAMPA interrupt */
  PIT1_ROLLOVR_IRQn            = 85,               /**< PIT1_ROLLOVR interrupt */
  PIT0_ROLLOVR_IRQn            = 86,               /**< PIT0_ROLLOVR interrupt */
  Reserved87_IRQn              = 87,               /**< Reserved interrupt */
  Reserved88_IRQn              = 88,               /**< Reserved interrupt */
  Reserved89_IRQn              = 89,               /**< Reserved interrupt */
  Reserved90_IRQn              = 90,               /**< Reserved interrupt */
  Reserved91_IRQn              = 91,               /**< Reserved interrupt */
  Reserved92_IRQn              = 92,               /**< Reserved interrupt */
  GPIOF_IRQn                   = 93,               /**< GPIOF interrupt */
  GPIOE_IRQn                   = 94,               /**< GPIOE interrupt */
  GPIOD_IRQn                   = 95,               /**< GPIOD interrupt */
  GPIOC_IRQn                   = 96,               /**< GPIOC interrupt */
  GPIOB_IRQn                   = 97,               /**< GPIOB interrupt */
  GPIOA_IRQn                   = 98,               /**< GPIOA interrupt */
  COP_INT_IRQn                 = 99,               /**< COP_INT interrupt */
  EWM_INT_IRQn                 = 100,              /**< EWM_INT interrupt */
  Reserved101_IRQn             = 101,              /**< Reserved interrupt */
  Reserved102_IRQn             = 102,              /**< Reserved interrupt */
  Reserved103_IRQn             = 103               /**< Reserved interrupt */
} IRQn_Type;

/*!
 * @}
 */ /* end of group Interrupt_IRQ_numbers */


/* ----------------------------------------------------------------------------
   -- Includes and Typedefs
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup Includes_And_Typedes Includes and Typedefs
 * @{
 */

#include <stdint.h>

#define __IO volatile
#define __I const volatile
#define __O volatile

#ifdef __cplusplus
  typedef unsigned char uint8_t;
  typedef unsigned short uint16_t;
  typedef unsigned long uint32_t;
#endif

/*!
 * @}
 */ /* end of group Includes_And_Typedes */


#ifndef MC56F80623_SERIES
#define MC56F80623_SERIES
#endif
/* CPU specific feature definitions */
#include "MC56F80623_features.h"

/* ADC - Peripheral instance base addresses */
/** Peripheral ADC base address */
#define ADC_BASE                                 (0xE500u)
/** Peripheral ADC base pointer */
#define ADC                                      ((ADC_Type *)ADC_BASE)
/** Array initializer of ADC peripheral base addresses */
#define ADC_BASE_ADDRS                           { ADC_BASE }
/** Array initializer of ADC peripheral base pointers */
#define ADC_BASE_PTRS                            { ADC }

/* CMP - Peripheral instance base addresses */
/** Peripheral CMPA base address */
#define CMPA_BASE                                (0xE020u)
/** Peripheral CMPA base pointer */
#define CMPA                                     ((CMP_Type *)CMPA_BASE)
/** Peripheral CMPB base address */
#define CMPB_BASE                                (0xE028u)
/** Peripheral CMPB base pointer */
#define CMPB                                     ((CMP_Type *)CMPB_BASE)
/** Peripheral CMPC base address */
#define CMPC_BASE                                (0xE030u)
/** Peripheral CMPC base pointer */
#define CMPC                                     ((CMP_Type *)CMPC_BASE)
/** Array initializer of CMP peripheral base addresses */
#define CMP_BASE_ADDRS                           { CMPA_BASE, CMPB_BASE, CMPC_BASE }
/** Array initializer of CMP peripheral base pointers */
#define CMP_BASE_PTRS                            { CMPA, CMPB, CMPC }

/* COP - Peripheral instance base addresses */
/** Peripheral COP base address */
#define COP_BASE                                 (0xE320u)
/** Peripheral COP base pointer */
#define COP                                      ((COP_Type *)COP_BASE)
/** Array initializer of COP peripheral base addresses */
#define COP_BASE_ADDRS                           { COP_BASE }
/** Array initializer of COP peripheral base pointers */
#define COP_BASE_PTRS                            { COP }

